{
  "version": "1.0",
  "texts": {
    "95ab069b-93ce-4889-ac1b-008e19fd0a57": {
      "id": "95ab069b-93ce-4889-ac1b-008e19fd0a57",
      "title": "puma",
      "content": "Pumas are large, cat-like animals which are found in America. When reports came into London Zoo that a wild puma had been spotted forty-five miles south of London, they were not taken seriously. However, as the evidence began to accumulate, experts from the Zoo felt obliged to investigate, for the descriptions given by people who claimed to have seen the puma were extraordinarily similar.\n\nThe hunt for the puma began in a small village where a woman picking strawberries saw 'a large cat' only five yards away from her. It immediately ran away when she saw it, and experts confirmed that a puma will not attack a human being unless it is cornered. The search proved difficult, for the puma was often observed at one place in the morning and at another place twenty miles away in the evening. Wherever it went, it left behind it a trail of dead deer and small animals like rabbits. Paw prints were seen in a number of places and puma fur was found clinging to bushes. Several people complained of 'cat-like noises' at night and a businessman on a fishing trip saw the puma up a tree. The experts were now fully convinced that the animal was a puma, but where had it come from? As no pumas had been reported missing from any zoo in the country, this one must have been in the possession of a private collector and somehow managed to escape. The hunt went on for several weeks, but the puma was not caught. It is disturbing to think that a dangerous wild animal is still at large in the quiet countryside.",
      "word_count": 273,
      "created_at": "2025-08-31T07:47:59.151767",
      "practice_type": "translation",
      "topic": null,
      "folder_id": "82419708-8fc2-4d81-866e-56e6a45884f1",
      "last_opened": "2025-08-31T08:17:31.169947"
    },
    "73e9406e-c1fe-410e-8a3e-9980ead9337b": {
      "id": "73e9406e-c1fe-410e-8a3e-9980ead9337b",
      "title": "post1",
      "content": "Contemporary vocabulary for talking about software testing has bothered me for a long time. The concept of a unit in unit test is not really defined, integration tests are integrating arbitrarily scoped modules, the concept of an E2E test makes sense, but it very much underspecifies the actually tested behavior as well as methods for testing it, are you using automated agents, human supervision, predefined set of actions, random exploration... it's all sweeped under the rug. On the other side you have your stress tests, load tests, peneration tests etc. but there is no proper classification in the wild, it all seems to be based on \"vibes\". A short web search reveals a \"level\" based classification as seen below, as well as an \"ad\" from Atlassian that gives you 7 \"types\" of software tests.",
      "word_count": 134,
      "created_at": "2025-08-31T08:55:34.289573",
      "practice_type": "translation",
      "topic": null,
      "folder_id": null,
      "last_opened": "2025-08-31T08:58:32.870938"
    },
    "432c6f44-3d67-4385-b3d9-8d1399bacc1f": {
      "id": "432c6f44-3d67-4385-b3d9-8d1399bacc1f",
      "title": "复习材料_0831",
      "content": "In our daily lives, we often use simple expressions to communicate. For example, when meeting someone, we usually say, \"Hello, how are you?\" Many people reply, \"I'm fine, thank you.\" This is a common and polite way to greet others. Sometimes, we talk about our routines. I wake up early every morning and have breakfast. Then, I go to work or study. In the evening, I like to relax by reading a book or watching television. These basic sentences help us share information clearly. It is important to practice them regularly to improve our English skills. With consistent effort, speaking becomes easier and more natural.",
      "word_count": 105,
      "created_at": "2025-08-31T08:59:22.271560",
      "practice_type": "review",
      "source": "ai_generated_review",
      "folder_id": null,
      "last_opened": "2025-08-31T08:59:43.298563"
    }
  }
}