{
  "version": "1.0",
  "texts": {
    "b9642ba7-f49e-4ae2-afe6-4a3ee8d05d47": {
      "id": "b9642ba7-f49e-4ae2-afe6-4a3ee8d05d47",
      "title": "0911_1",
      "content": "Naturally, readers who open this book will have reached varying levels of skill in their second language. But to one degree or another, the work of all but the most highly trained and experienced among them will inevitably contain elements of Chinglish. Chinglish, of course, is that misshapen, hybrid language that is neither English nor Chinese but that might be described as \"English with Chinese characteristics.\"",
      "word_count": 66,
      "created_at": "2025-09-11T08:40:58.848654",
      "folder_id": null,
      "last_opened": "2025-09-11T09:10:24.972313",
      "practice_type": "translation",
      "topic": null
    },
    "26f1d9a9-846d-406f-93e9-6c68ae58d20a": {
      "id": "26f1d9a9-846d-406f-93e9-6c68ae58d20a",
      "title": "0911_2",
      "content": "It follows that any words which perform no useful function in the sentence—that is, which add nothing to the meaning—should be edited out. Almost every text that has been translated into English from Chinese, (or that has been written directly in English by a native speaker of Chinese) contains unnecessary words. Draft translations are commonly full of them, and even polished final versions are seldom free of them.",
      "word_count": 68,
      "created_at": "2025-09-11T09:02:54.654418",
      "folder_id": null,
      "last_opened": "2025-09-11T09:03:30.716602",
      "practice_type": "translation",
      "topic": null
    },
    "5f33f69b-d7bb-4951-b3e5-1ec420820dbd": {
      "id": "5f33f69b-d7bb-4951-b3e5-1ec420820dbd",
      "title": "0911_3",
      "content": "Any adjective describes the \"nature\" or \"character\" of the noun it modifies. To say that hardships are \"temporary in nature\" is like saying that the Chinese flag is \"red in color\" or that pandas are \"few in number.\"",
      "word_count": 38,
      "created_at": "2025-09-11T09:15:20.037235",
      "folder_id": null,
      "last_opened": "2025-09-13T08:02:40.300216",
      "practice_type": "translation",
      "topic": null
    }
  }
}